os2web_acadre_arp/test_data/request-0.soap_0.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:AcadrePublishingHandler">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:publish soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/>
      asdgsadgsadgsadg
   </soapenv:Body>
</soapenv:Envelope>